fixtures/vcr_cassettes/stripe_update_intent.yml

---
http_interactions:
  - request:
      method: post
      uri: https://api.stripe.com/v1/payment_intents/pi_3QUVXeFWpgsj4fDK05NxCc94
      body:
        encoding: UTF-8
        string: amount=1998&currency=gbp&receipt_email=patricia.schneider%40greenholt.test
      headers:
        User-Agent:
          - Stripe/v1 RubyBindings/13.1.2
        Authorization:
          - Bearer sk_test_51QMsP1FWpgsj4fDKsFnEmd0V2MbHbpnZSTxp8ZWfjNPxNk1amjxt0jr68fAWryudaxaDxakEFmt2oGFfHDCRn0cA00jWOXWIae
        X-Stripe-Client-Telemetry:
          - '{"last_request_metrics":{"request_id":"req_4hYFVzbOoPW0Wq","request_duration_ms":1}}'
        Idempotency-Key:
          - 7e0051b9-3f8a-46b0-b42e-d8554a92b866
        Stripe-Version:
          - 2024-10-28.acacia
        X-Stripe-Client-User-Agent:
          - '{"bindings_version":"13.1.2","lang":"ruby","lang_version":"3.2.2 p53 (2023-03-30)","platform":"x86_64-darwin23","engine":"ruby","publisher":"stripe","uname":"Darwin
            BTM-K4DW71QC57 23.5.0 Darwin Kernel Version 23.5.0: Wed May  1 20:12:58 PDT
            2024; root:xnu-10063.121.3~5/RELEASE_ARM64_T6000 x86_64","hostname":"BTM-K4DW71QC57"}'
        Content-Type:
          - application/x-www-form-urlencoded
        Accept-Encoding:
          - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
        Accept:
          - "*/*"
    response:
      status:
        code: 200
        message: OK
      headers:
        Server:
          - nginx
        Date:
          - Tue, 10 Dec 2024 15:43:58 GMT
        Content-Type:
          - application/json
        Content-Length:
          - "1541"
        Connection:
          - keep-alive
        Access-Control-Allow-Credentials:
          - "true"
        Access-Control-Allow-Methods:
          - GET, HEAD, PUT, PATCH, POST, DELETE
        Access-Control-Allow-Origin:
          - "*"
        Access-Control-Expose-Headers:
          - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
            X-Stripe-Privileged-Session-Required
        Access-Control-Max-Age:
          - "300"
        Cache-Control:
          - no-cache, no-store
        Content-Security-Policy:
          - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
            img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; upgrade-insecure-requests;
            report-uri /csp-violation
        Cross-Origin-Opener-Policy-Report-Only:
          - same-origin; report-to="coop"
        Idempotency-Key:
          - 7e0051b9-3f8a-46b0-b42e-d8554a92b866
        Original-Request:
          - req_GicjHS2ggtBxXP
        Report-To:
          - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
        Reporting-Endpoints:
          - coop="https://q.stripe.com/coop-report"
        Request-Id:
          - req_GicjHS2ggtBxXP
        Stripe-Should-Retry:
          - "false"
        Stripe-Version:
          - 2024-10-28.acacia
        Vary:
          - Origin
        X-Content-Type-Options:
          - nosniff
        X-Stripe-Priority-Routing-Enabled:
          - "true"
        X-Stripe-Routing-Context-Priority-Tier:
          - api-testmode
        X-Wc:
          - AB
        Strict-Transport-Security:
          - max-age=63072000; includeSubDomains; preload
      body:
        encoding: UTF-8
        string: |-
          {
            "id": "pi_3QUVXeFWpgsj4fDK05NxCc94",
            "object": "payment_intent",
            "amount": 1998,
            "amount_capturable": 0,
            "amount_details": {
              "tip": {}
            },
            "amount_received": 0,
            "application": null,
            "application_fee_amount": null,
            "automatic_payment_methods": {
              "allow_redirects": "always",
              "enabled": true
            },
            "canceled_at": null,
            "cancellation_reason": null,
            "capture_method": "automatic_async",
            "client_secret": "pi_3QUVXeFWpgsj4fDK05NxCc94_secret_sl8a0nX9wXubwCWAzEsldI7Tw",
            "confirmation_method": "automatic",
            "created": 1733845206,
            "currency": "gbp",
            "customer": null,
            "description": null,
            "invoice": null,
            "last_payment_error": null,
            "latest_charge": null,
            "livemode": false,
            "metadata": {},
            "next_action": null,
            "on_behalf_of": null,
            "payment_method": null,
            "payment_method_configuration_details": {
              "id": "pmc_1QUVA6FWpgsj4fDKbxDqhxKv",
              "parent": null
            },
            "payment_method_options": {
              "card": {
                "installments": null,
                "mandate_options": null,
                "network": null,
                "request_three_d_secure": "automatic"
              },
              "link": {
                "persistent_token": null
              }
            },
            "payment_method_types": [
              "card",
              "link"
            ],
            "processing": null,
            "receipt_email": "patricia.schneider@greenholt.test",
            "review": null,
            "setup_future_usage": null,
            "shipping": null,
            "source": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "requires_payment_method",
            "transfer_data": null,
            "transfer_group": null
          }
    recorded_at: Tue, 10 Dec 2024 15:43:58 GMT
recorded_with: VCR 6.3.1
